# Filling Null Values in Series and DataFrame

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [4]:
ser1=Series([1,2,3,np.nan,4,np.nan,np.nan,5],index=list('ABCDEFGH'))

In [5]:
ser

A    1.0
B    2.0
C    3.0
D    NaN
E    4.0
F    NaN
G    NaN
H    5.0
dtype: float64

In [6]:
ser1.fillna(5) #to fill NaN values

A    1.0
B    2.0
C    3.0
D    5.0
E    4.0
F    5.0
G    5.0
H    5.0
dtype: float64

In [7]:
ser1

A    1.0
B    2.0
C    3.0
D    NaN
E    4.0
F    NaN
G    NaN
H    5.0
dtype: float64

In [8]:
ser1.fillna(5,inplace=True)

In [9]:
ser1

A    1.0
B    2.0
C    3.0
D    5.0
E    4.0
F    5.0
G    5.0
H    5.0
dtype: float64

In [13]:
df1=DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [14]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [15]:
df1.fillna(5)

     0    1    2
0  1.0  2.0  3.0
1  5.0  5.0  6.0
2  7.0  5.0  9.0
3  5.0  5.0  5.0

In [17]:
df1[0]=df1.fillna(5)

In [18]:
df1

     0    1    2
0  1.0  2.0  3.0
1  5.0  5.0  6.0
2  7.0  NaN  9.0
3  5.0  NaN  NaN

In [20]:
df1[0].fillna(5,inplace=True) #to fill Nan in particular column ie 0

In [21]:
df1

     0    1    2
0  1.0  2.0  3.0
1  5.0  5.0  6.0
2  7.0  NaN  9.0
3  5.0  NaN  NaN

# Rename Index In Series and DataFrame

In [24]:
ser1=Series(np.arange(0,8),index=list('ABCDEFGH'))

In [25]:
ser1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
dtype: int32

In [28]:
ser1.rename({'A':'Alpha','B':'Beta'},inplace=True) #rename index rename(old value:new value)

In [29]:
ser1

Alpha    0
Beta     1
C        2
D        3
E        4
F        5
G        6
H        7
dtype: int32

In [32]:
df1=DataFrame(np.arange(0,9).reshape(3,3),columns=['NY','LA','SF'],index=list('ABC'))

In [33]:
df1

   NY  LA  SF
A   0   1   2
B   3   4   5
C   6   7   8

In [34]:
df1.rename({'A':'Alpha'})

       NY  LA  SF
Alpha   0   1   2
B       3   4   5
C       6   7   8

In [35]:
df1.rename({'NY':'Newyork'},axis=1) #to select columns 1st method

   Newyork  LA  SF
A        0   1   2
B        3   4   5
C        6   7   8

In [39]:
df1.rename(columns={'NY':'Newyork'}) #2nd method

   Newyork  LA  SF
A        0   1   2
B        3   4   5
C        6   7   8

In [38]:
df1.rename({'B':'Beta'},columns={'SF':'San'})

      NY  LA  San
A      0   1    2
Beta   3   4    5
C      6   7    8

# Replace

In [40]:
s1=Series(['One','Two','Three','Four'])

In [41]:
s1

0      One
1      Two
2    Three
3     Four
dtype: object

In [42]:
s1.replace({'One':'Five','Two':'Six'})     #To replace the values in Series

0     Five
1      Six
2    Three
3     Four
dtype: object

In [44]:
s1.replace(['One','Two'],['Five','Six'],inplace=True)

In [45]:
s1

0     Five
1      Six
2    Three
3     Four
dtype: object

In [46]:
df01=DataFrame(np.arange(0,16).reshape(4,4),columns=['A','B','C','D'])

In [47]:
df01

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [48]:
df01.replace({1:100})

    A    B   C   D
0   0  100   2   3
1   4    5   6   7
2   8    9  10  11
3  12   13  14  15

# Multi-Index and Index Hierarchy

Hierarchy is the parent child for row and column

In [54]:
ser=Series(np.arange(5),index=[[1,1,2,2,3],['A','B','A','C','B']]) # parent and child

In [55]:
ser #1 is child and A B are there child

1  A    0
   B    1
2  A    2
   C    3
3  B    4
dtype: int32

In [56]:
ser.index #levels shows parent[] and child names[] uniqly

MultiIndex(levels=[[1, 2, 3], ['A', 'B', 'C']],
           codes=[[0, 0, 1, 1, 2], [0, 1, 0, 2, 1]])

In [57]:
ser[1] #accesing values using parent index

A    0
B    1
dtype: int32

In [58]:
ser[2,'C']

3

In [59]:
ser[3,'B']

4

In [63]:
ser[:,'B'] #selecting all rows and B childs

1    1
3    4
dtype: int32

In [64]:
ser=Series(['A','A','B','B','B','D','D','E'],index=[['A','A','B','B','B','D','D','E'],[1,2,1,2,3,4,5,8]])

In [65]:
ser

A  1    A
   2    A
B  1    B
   2    B
   3    B
D  4    D
   5    D
E  8    E
dtype: object

In [66]:
ser['D']

4    D
5    D
dtype: object

In [67]:
ser['E']

8    E
dtype: object

In [69]:
ser['B',1]

'B'